vahidtaghiloo/stm32f103-nixieclock/Src/nixie.c
/*
  *****************************************************************************
  * @file    nixie.c
  * @author  
  * @brief   Source file for nixie tube clock.
  *****************************************************************************
*/

#include <stdint.h>
#include "nixie.h"
#include "stm32f1xx_hal.h"

extern SPI_HandleTypeDef hspi1;

uint8_t Nixie_Buffer[13] = {};
uint32_t Alpha_Worldlines[12] = {571082, 571046, 571024, 571015,
                               523307, 523299, 456914, 456903,
                               409431, 409420, 334581, 337187};

/**
  * @brief  Displays the rightmost digit on Nixie8
  */
void Nixie8(uint8_t digit)
{
  switch (digit)
  {
  case 0:
    Nixie_Buffer[0] = 0x40;
    Nixie_Buffer[1] = 0x08;
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET);
    HAL_SPI_Transmit(&hspi1, Nixie_Buffer, sizeof(Nixie_Buffer), HAL_MAX_DELAY);
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_SET);
    HAL_Delay(delay);
    break;

  case 1:
    Nixie_Buffer[0] = 0x00;
    Nixie_Buffer[1] = 0x28;
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET);
    HAL_SPI_Transmit(&hspi1, Nixie_Buffer, sizeof(Nixie_Buffer), HAL_MAX_DELAY);
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_SET);
    HAL_Delay(delay);
    break;

  case 2:
    Nixie_Buffer[0] = 0x00;
    Nixie_Buffer[1] = 0x48;
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET);
    HAL_SPI_Transmit(&hspi1, Nixie_Buffer, sizeof(Nixie_Buffer), HAL_MAX_DELAY);
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_SET);
    HAL_Delay(delay);
    break;

  case 3:
    Nixie_Buffer[0] = 0x00;
    Nixie_Buffer[1] = 0x88;
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET);
    HAL_SPI_Transmit(&hspi1, Nixie_Buffer, sizeof(Nixie_Buffer), HAL_MAX_DELAY);
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_SET);
    HAL_Delay(delay);
    break;

  case 4:
    Nixie_Buffer[0] = 0x01;
    Nixie_Buffer[1] = 0x08;
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET);
    HAL_SPI_Transmit(&hspi1, Nixie_Buffer, sizeof(Nixie_Buffer), HAL_MAX_DELAY);
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_SET);
    HAL_Delay(delay);
    break;

  case 5:
    Nixie_Buffer[0] = 0x02;
    Nixie_Buffer[1] = 0x08;
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET);
    HAL_SPI_Transmit(&hspi1, Nixie_Buffer, sizeof(Nixie_Buffer), HAL_MAX_DELAY);
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_SET);
    HAL_Delay(delay);
    break;

  case 6:
    Nixie_Buffer[0] = 0x04;
    Nixie_Buffer[1] = 0x08;
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET);
    HAL_SPI_Transmit(&hspi1, Nixie_Buffer, sizeof(Nixie_Buffer), HAL_MAX_DELAY);
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_SET);
    HAL_Delay(delay);
    break;

  case 7:
    Nixie_Buffer[0] = 0x08;
    Nixie_Buffer[1] = 0x08;
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET);
    HAL_SPI_Transmit(&hspi1, Nixie_Buffer, sizeof(Nixie_Buffer), HAL_MAX_DELAY);
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_SET);
    HAL_Delay(delay);
    break;

  case 8:
    Nixie_Buffer[0] = 0x10;
    Nixie_Buffer[1] = 0x08;
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET);
    HAL_SPI_Transmit(&hspi1, Nixie_Buffer, sizeof(Nixie_Buffer), HAL_MAX_DELAY);
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_SET);
    HAL_Delay(delay);
    break;

  case 9:
    Nixie_Buffer[0] = 0x20;
    Nixie_Buffer[1] = 0x08;
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET);
    HAL_SPI_Transmit(&hspi1, Nixie_Buffer, sizeof(Nixie_Buffer), HAL_MAX_DELAY);
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_SET);
    HAL_Delay(delay);
    break;

  case 10:
    Nixie_Buffer[0] = 0x80;
    Nixie_Buffer[1] = 0x08;
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET);
    HAL_SPI_Transmit(&hspi1, Nixie_Buffer, sizeof(Nixie_Buffer), HAL_MAX_DELAY);
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_SET);
    HAL_Delay(delay);
    break;

  case 11:
    Nixie_Buffer[0] = 0x00;
    Nixie_Buffer[1] = 0x18;
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET);
    HAL_SPI_Transmit(&hspi1, Nixie_Buffer, sizeof(Nixie_Buffer), HAL_MAX_DELAY);
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_SET);
    HAL_Delay(delay);
    break;
  }
}

void Nixie7(uint8_t digit)
{
  switch (digit)
  {
  case 0:
    Nixie_Buffer[1] = 0x02;
    Nixie_Buffer[2] = 0x00;
    Nixie_Buffer[3] = 0x40;
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET);
    HAL_SPI_Transmit(&hspi1, Nixie_Buffer, sizeof(Nixie_Buffer), HAL_MAX_DELAY);
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_SET);
    HAL_Delay(delay);
    break;

  case 1:
    Nixie_Buffer[1] = 0x00;
    Nixie_Buffer[2] = 0x01;
    Nixie_Buffer[3] = 0x40;
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET);
    HAL_SPI_Transmit(&hspi1, Nixie_Buffer, sizeof(Nixie_Buffer), HAL_MAX_DELAY);
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_SET);
    HAL_Delay(delay);
    break;

  case 2:
    Nixie_Buffer[1] = 0x00;
    Nixie_Buffer[2] = 0x02;
    Nixie_Buffer[3] = 0x40;
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET);
    HAL_SPI_Transmit(&hspi1, Nixie_Buffer, sizeof(Nixie_Buffer), HAL_MAX_DELAY);
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_SET);
    HAL_Delay(delay);
    break;

  case 3:
    Nixie_Buffer[1] = 0x00;
    Nixie_Buffer[2] = 0x04;
    Nixie_Buffer[3] = 0x40;
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET);
    HAL_SPI_Transmit(&hspi1, Nixie_Buffer, sizeof(Nixie_Buffer), HAL_MAX_DELAY);
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_SET);
    HAL_Delay(delay);
    break;

  case 4:
    Nixie_Buffer[1] = 0x00;
    Nixie_Buffer[2] = 0x08;
    Nixie_Buffer[3] = 0x40;
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET);
    HAL_SPI_Transmit(&hspi1, Nixie_Buffer, sizeof(Nixie_Buffer), HAL_MAX_DELAY);
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_SET);
    HAL_Delay(delay);
    break;

  case 5:
    Nixie_Buffer[1] = 0x00;
    Nixie_Buffer[2] = 0x10;
    Nixie_Buffer[3] = 0x40;
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET);
    HAL_SPI_Transmit(&hspi1, Nixie_Buffer, sizeof(Nixie_Buffer), HAL_MAX_DELAY);
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_SET);
    HAL_Delay(delay);
    break;

