vahidtaghiloo/stm32f103-nixieclock/Src/nixie.c
  case 6:
    Nixie_Buffer[1] = 0x00;
    Nixie_Buffer[2] = 0x20;
    Nixie_Buffer[3] = 0x40;
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET);
    HAL_SPI_Transmit(&hspi1, Nixie_Buffer, sizeof(Nixie_Buffer), HAL_MAX_DELAY);
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_SET);
    HAL_Delay(delay);
    break;

  case 7:
    Nixie_Buffer[1] = 0x00;
    Nixie_Buffer[2] = 0x40;
    Nixie_Buffer[3] = 0x40;
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET);
    HAL_SPI_Transmit(&hspi1, Nixie_Buffer, sizeof(Nixie_Buffer), HAL_MAX_DELAY);
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_SET);
    HAL_Delay(delay);
    break;

  case 8:
    Nixie_Buffer[1] = 0x00;
    Nixie_Buffer[2] = 0x80;
    Nixie_Buffer[3] = 0x40;
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET);
    HAL_SPI_Transmit(&hspi1, Nixie_Buffer, sizeof(Nixie_Buffer), HAL_MAX_DELAY);
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_SET);
    HAL_Delay(delay);
    break;

  case 9:
    Nixie_Buffer[1] = 0x01;
    Nixie_Buffer[2] = 0x00;
    Nixie_Buffer[3] = 0x40;
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET);
    HAL_SPI_Transmit(&hspi1, Nixie_Buffer, sizeof(Nixie_Buffer), HAL_MAX_DELAY);
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_SET);
    HAL_Delay(delay);
    break;

  case 10:
    Nixie_Buffer[1] = 0x04;
    Nixie_Buffer[2] = 0x00;
    Nixie_Buffer[3] = 0x40;
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET);
    HAL_SPI_Transmit(&hspi1, Nixie_Buffer, sizeof(Nixie_Buffer), HAL_MAX_DELAY);
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_SET);
    HAL_Delay(delay);
    break;

  case 11:
    Nixie_Buffer[1] = 0x00;
    Nixie_Buffer[2] = 0x00;
    Nixie_Buffer[3] = 0xC0;
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET);
    HAL_SPI_Transmit(&hspi1, Nixie_Buffer, sizeof(Nixie_Buffer), HAL_MAX_DELAY);
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_SET);
    HAL_Delay(delay);
    break;
  }
}


void Nixie6(uint8_t digit)
{
  switch (digit)
  {
  case 0:
    Nixie_Buffer[3] = 0x10;
    Nixie_Buffer[4] = 0x02;
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET);
    HAL_SPI_Transmit(&hspi1, Nixie_Buffer, sizeof(Nixie_Buffer), HAL_MAX_DELAY);
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_SET);
    HAL_Delay(delay);
    break;

  case 1:
    Nixie_Buffer[3] = 0x00;
    Nixie_Buffer[4] = 0x0A;
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET);
    HAL_SPI_Transmit(&hspi1, Nixie_Buffer, sizeof(Nixie_Buffer), HAL_MAX_DELAY);
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_SET);
    HAL_Delay(delay);
    break;

  case 2:
    Nixie_Buffer[3] = 0x00;
    Nixie_Buffer[4] = 0x12;
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET);
    HAL_SPI_Transmit(&hspi1, Nixie_Buffer, sizeof(Nixie_Buffer), HAL_MAX_DELAY);
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_SET);
    HAL_Delay(delay);
    break;

  case 3:
    Nixie_Buffer[3] = 0x00;
    Nixie_Buffer[4] = 0x22;
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET);
    HAL_SPI_Transmit(&hspi1, Nixie_Buffer, sizeof(Nixie_Buffer), HAL_MAX_DELAY);
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_SET);
    HAL_Delay(delay);
    break;

  case 4:
    Nixie_Buffer[3] = 0x00;
    Nixie_Buffer[4] = 0x42;
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET);
    HAL_SPI_Transmit(&hspi1, Nixie_Buffer, sizeof(Nixie_Buffer), HAL_MAX_DELAY);
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_SET);
    HAL_Delay(delay);
    break;

  case 5:
    Nixie_Buffer[3] = 0x00;
    Nixie_Buffer[4] = 0x82;
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET);
    HAL_SPI_Transmit(&hspi1, Nixie_Buffer, sizeof(Nixie_Buffer), HAL_MAX_DELAY);
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_SET);
    HAL_Delay(delay);
    break;

  case 6:
    Nixie_Buffer[3] = 0x01;
    Nixie_Buffer[4] = 0x02;
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET);
    HAL_SPI_Transmit(&hspi1, Nixie_Buffer, sizeof(Nixie_Buffer), HAL_MAX_DELAY);
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_SET);
    HAL_Delay(delay);
    break;

  case 7:
    Nixie_Buffer[3] = 0x02;
    Nixie_Buffer[4] = 0x02;
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET);
    HAL_SPI_Transmit(&hspi1, Nixie_Buffer, sizeof(Nixie_Buffer), HAL_MAX_DELAY);
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_SET);
    HAL_Delay(delay);
    break;

  case 8:
    Nixie_Buffer[3] = 0x04;
    Nixie_Buffer[4] = 0x02;
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET);
    HAL_SPI_Transmit(&hspi1, Nixie_Buffer, sizeof(Nixie_Buffer), HAL_MAX_DELAY);
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_SET);
    HAL_Delay(delay);
    break;

  case 9:
    Nixie_Buffer[3] = 0x08;
    Nixie_Buffer[4] = 0x02;
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET);
    HAL_SPI_Transmit(&hspi1, Nixie_Buffer, sizeof(Nixie_Buffer), HAL_MAX_DELAY);
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_SET);
    HAL_Delay(delay);
    break;

  case 10: //RP
    Nixie_Buffer[3] = 0x20;
    Nixie_Buffer[4] = 0x02;
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET);
    HAL_SPI_Transmit(&hspi1, Nixie_Buffer, sizeof(Nixie_Buffer), HAL_MAX_DELAY);
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_SET);
    HAL_Delay(delay);
    break;

  case 11: //LP
    Nixie_Buffer[3] = 0x00;
    Nixie_Buffer[4] = 0x06;
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET);
    HAL_SPI_Transmit(&hspi1, Nixie_Buffer, sizeof(Nixie_Buffer), HAL_MAX_DELAY);
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_SET);
    HAL_Delay(delay);
    break;
  }
}


void Nixie5(uint8_t digit)
{
  switch (digit)
  {
  case 0:
    Nixie_Buffer[5] = 0x80;
    Nixie_Buffer[6] = 0x10;
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET);
    HAL_SPI_Transmit(&hspi1, Nixie_Buffer, sizeof(Nixie_Buffer), HAL_MAX_DELAY);
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_SET);
    HAL_Delay(delay);
    break;

  case 1:
    Nixie_Buffer[5] = 0x00;
    Nixie_Buffer[6] = 0x50;
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET);
    HAL_SPI_Transmit(&hspi1, Nixie_Buffer, sizeof(Nixie_Buffer), HAL_MAX_DELAY);
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_SET);
    HAL_Delay(delay);
    break;

