vahidtaghiloo/stm32f103-nixieclock/Src/nixie.c
  case 2:
    Nixie_Buffer[8] = 0x00;
    Nixie_Buffer[9] = 0x24;
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET);
    HAL_SPI_Transmit(&hspi1, Nixie_Buffer, sizeof(Nixie_Buffer), HAL_MAX_DELAY);
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_SET);
    HAL_Delay(delay);
    break;

  case 3:
    Nixie_Buffer[8] = 0x00;
    Nixie_Buffer[9] = 0x44;
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET);
    HAL_SPI_Transmit(&hspi1, Nixie_Buffer, sizeof(Nixie_Buffer), HAL_MAX_DELAY);
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_SET);
    HAL_Delay(delay);
    break;

  case 4:
    Nixie_Buffer[8] = 0x00;
    Nixie_Buffer[9] = 0x88;
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET);
    HAL_SPI_Transmit(&hspi1, Nixie_Buffer, sizeof(Nixie_Buffer), HAL_MAX_DELAY);
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_SET);
    HAL_Delay(delay);
    break;

  case 5:
    Nixie_Buffer[0] = 0x01;
    Nixie_Buffer[1] = 0x04;
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET);
    HAL_SPI_Transmit(&hspi1, Nixie_Buffer, sizeof(Nixie_Buffer), HAL_MAX_DELAY);
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_SET);
    HAL_Delay(delay);
    break;

  case 6:
    Nixie_Buffer[8] = 0x02;
    Nixie_Buffer[9] = 0x04;
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET);
    HAL_SPI_Transmit(&hspi1, Nixie_Buffer, sizeof(Nixie_Buffer), HAL_MAX_DELAY);
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_SET);
    HAL_Delay(delay);
    break;

  case 7:
    Nixie_Buffer[8] = 0x04;
    Nixie_Buffer[8] = 0x04;
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET);
    HAL_SPI_Transmit(&hspi1, Nixie_Buffer, sizeof(Nixie_Buffer), HAL_MAX_DELAY);
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_SET);
    HAL_Delay(delay);
    break;

  case 8:
    Nixie_Buffer[8] = 0x08;
    Nixie_Buffer[9] = 0x04;
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET);
    HAL_SPI_Transmit(&hspi1, Nixie_Buffer, sizeof(Nixie_Buffer), HAL_MAX_DELAY);
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_SET);
    HAL_Delay(delay);
    break;

  case 9:
    Nixie_Buffer[8] = 0x10;
    Nixie_Buffer[9] = 0x04;
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET);
    HAL_SPI_Transmit(&hspi1, Nixie_Buffer, sizeof(Nixie_Buffer), HAL_MAX_DELAY);
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_SET);
    HAL_Delay(delay);
    break;

  case 10: //RP
    Nixie_Buffer[8] = 0x40;
    Nixie_Buffer[9] = 0x04;
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET);
    HAL_SPI_Transmit(&hspi1, Nixie_Buffer, sizeof(Nixie_Buffer), HAL_MAX_DELAY);
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_SET);
    HAL_Delay(delay);
    break;

  case 11: //LP
    Nixie_Buffer[4] = 0x00;
    Nixie_Buffer[5] = 0x0C;
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET);
    HAL_SPI_Transmit(&hspi1, Nixie_Buffer, sizeof(Nixie_Buffer), HAL_MAX_DELAY);
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_SET);
    HAL_Delay(delay);
    break;
  }
}


void Nixie2(uint8_t digit)
{
  switch (digit)
  {
  case 0:
    Nixie_Buffer[9] = 0x01;
    Nixie_Buffer[10] = 0x00;
    Nixie_Buffer[11] = 0x20;
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET);
    HAL_SPI_Transmit(&hspi1, Nixie_Buffer, sizeof(Nixie_Buffer), HAL_MAX_DELAY);
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_SET);
    HAL_Delay(delay);
    break;

  case 1:
    Nixie_Buffer[9] = 0x00;
    Nixie_Buffer[10] = 0x00;
    Nixie_Buffer[11] = 0xA0;
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET);
    HAL_SPI_Transmit(&hspi1, Nixie_Buffer, sizeof(Nixie_Buffer), HAL_MAX_DELAY);
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_SET);
    HAL_Delay(delay);
    break;

  case 2:
    Nixie_Buffer[9] = 0x00;
    Nixie_Buffer[10] = 0x01;
    Nixie_Buffer[11] = 0x20;
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET);
    HAL_SPI_Transmit(&hspi1, Nixie_Buffer, sizeof(Nixie_Buffer), HAL_MAX_DELAY);
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_SET);
    HAL_Delay(delay);
    break;

  case 3:
    Nixie_Buffer[9] = 0x00;
    Nixie_Buffer[10] = 0x02;
    Nixie_Buffer[11] = 0x20;
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET);
    HAL_SPI_Transmit(&hspi1, Nixie_Buffer, sizeof(Nixie_Buffer), HAL_MAX_DELAY);
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_SET);
    HAL_Delay(delay);
    break;

  case 4:
    Nixie_Buffer[9] = 0x00;
    Nixie_Buffer[10] = 0x04;
    Nixie_Buffer[11] = 0x20;
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET);
    HAL_SPI_Transmit(&hspi1, Nixie_Buffer, sizeof(Nixie_Buffer), HAL_MAX_DELAY);
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_SET);
    HAL_Delay(delay);
    break;

  case 5:
    Nixie_Buffer[9] = 0x00;
    Nixie_Buffer[10] = 0x08;
    Nixie_Buffer[11] = 0x20;
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET);
    HAL_SPI_Transmit(&hspi1, Nixie_Buffer, sizeof(Nixie_Buffer), HAL_MAX_DELAY);
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_SET);
    HAL_Delay(delay);
    break;

  case 6:
    Nixie_Buffer[9] = 0x00;
    Nixie_Buffer[10] = 0x10;
    Nixie_Buffer[11] = 0x20;
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET);
    HAL_SPI_Transmit(&hspi1, Nixie_Buffer, sizeof(Nixie_Buffer), HAL_MAX_DELAY);
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_SET);
    HAL_Delay(delay);
    break;

  case 7:
    Nixie_Buffer[9] = 0x00;
    Nixie_Buffer[10] = 0x20;
    Nixie_Buffer[11] = 0x20;
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET);
    HAL_SPI_Transmit(&hspi1, Nixie_Buffer, sizeof(Nixie_Buffer), HAL_MAX_DELAY);
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_SET);
    HAL_Delay(delay);
    break;

  case 8:
    Nixie_Buffer[9] = 0x00;
    Nixie_Buffer[10] = 0x40;
    Nixie_Buffer[11] = 0x20;
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET);
    HAL_SPI_Transmit(&hspi1, Nixie_Buffer, sizeof(Nixie_Buffer), HAL_MAX_DELAY);
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_SET);
    HAL_Delay(delay);
    break;

  case 9:
    Nixie_Buffer[9] = 0x00;
    Nixie_Buffer[10] = 0x80;
    Nixie_Buffer[11] = 0x20;
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET);
    HAL_SPI_Transmit(&hspi1, Nixie_Buffer, sizeof(Nixie_Buffer), HAL_MAX_DELAY);
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_SET);
    HAL_Delay(delay);
    break;

  case 10: //RP
    Nixie_Buffer[9] = 0x02;
    Nixie_Buffer[10] = 0x00;
    Nixie_Buffer[11] = 0x20;
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET);
    HAL_SPI_Transmit(&hspi1, Nixie_Buffer, sizeof(Nixie_Buffer), HAL_MAX_DELAY);
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_SET);
    HAL_Delay(delay);
    break;

  case 11: //LP
    Nixie_Buffer[9] = 0x00;
    Nixie_Buffer[10] = 0x00;
    Nixie_Buffer[11] = 0x60;
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET);
    HAL_SPI_Transmit(&hspi1, Nixie_Buffer, sizeof(Nixie_Buffer), HAL_MAX_DELAY);
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_SET);
    HAL_Delay(delay);
    break;
  }
}

void Nixie1(uint8_t digit)
{
  switch (digit)
  {
  case 0:
    Nixie_Buffer[11] = 0x08;
    Nixie_Buffer[12] = 0x01;
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET);
    HAL_SPI_Transmit(&hspi1, Nixie_Buffer, sizeof(Nixie_Buffer), HAL_MAX_DELAY);
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_SET);
    HAL_Delay(delay);
    break;

  case 1:
    Nixie_Buffer[11] = 0x00;
    Nixie_Buffer[12] = 0x05;
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET);
    HAL_SPI_Transmit(&hspi1, Nixie_Buffer, sizeof(Nixie_Buffer), HAL_MAX_DELAY);
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_SET);
    HAL_Delay(delay);
    break;

