vahidtaghiloo/stm32f103-nixieclock/Src/nixie.c
  case 2:
    Nixie_Buffer[11] = 0x00;
    Nixie_Buffer[12] = 0x09;
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET);
    HAL_SPI_Transmit(&hspi1, Nixie_Buffer, sizeof(Nixie_Buffer), HAL_MAX_DELAY);
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_SET);
    HAL_Delay(delay);
    break;

  case 3:
    Nixie_Buffer[11] = 0x00;
    Nixie_Buffer[12] = 0x11;
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET);
    HAL_SPI_Transmit(&hspi1, Nixie_Buffer, sizeof(Nixie_Buffer), HAL_MAX_DELAY);
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_SET);
    HAL_Delay(delay);
    break;

  case 4:
    Nixie_Buffer[11] = 0x00;
    Nixie_Buffer[12] = 0x21;
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET);
    HAL_SPI_Transmit(&hspi1, Nixie_Buffer, sizeof(Nixie_Buffer), HAL_MAX_DELAY);
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_SET);
    HAL_Delay(delay);
    break;

  case 5:
    Nixie_Buffer[11] = 0x00;
    Nixie_Buffer[12] = 0x41;
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET);
    HAL_SPI_Transmit(&hspi1, Nixie_Buffer, sizeof(Nixie_Buffer), HAL_MAX_DELAY);
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_SET);
    HAL_Delay(delay);
    break;

  case 6:
    Nixie_Buffer[11] = 0x00;
    Nixie_Buffer[12] = 0x81;
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET);
    HAL_SPI_Transmit(&hspi1, Nixie_Buffer, sizeof(Nixie_Buffer), HAL_MAX_DELAY);
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_SET);
    HAL_Delay(delay);
    break;

  case 7:
    Nixie_Buffer[11] = 0x01;
    Nixie_Buffer[12] = 0x01;
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET);
    HAL_SPI_Transmit(&hspi1, Nixie_Buffer, sizeof(Nixie_Buffer), HAL_MAX_DELAY);
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_SET);
    HAL_Delay(delay);
    break;

  case 8:
    Nixie_Buffer[11] = 0x02;
    Nixie_Buffer[12] = 0x01;
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET);
    HAL_SPI_Transmit(&hspi1, Nixie_Buffer, sizeof(Nixie_Buffer), HAL_MAX_DELAY);
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_SET);
    HAL_Delay(delay);
    break;

  case 9:
    Nixie_Buffer[11] = 0x04;
    Nixie_Buffer[12] = 0x01;
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET);
    HAL_SPI_Transmit(&hspi1, Nixie_Buffer, sizeof(Nixie_Buffer), HAL_MAX_DELAY);
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_SET);
    HAL_Delay(delay);
    break;

  case 10: //RP
    Nixie_Buffer[11] = 0x10;
    Nixie_Buffer[12] = 0x01;
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET);
    HAL_SPI_Transmit(&hspi1, Nixie_Buffer, sizeof(Nixie_Buffer), HAL_MAX_DELAY);
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_SET);
    HAL_Delay(delay);
    break;

  case 11: //LP
    Nixie_Buffer[11] = 0x00;
    Nixie_Buffer[12] = 0x03;
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET);
    HAL_SPI_Transmit(&hspi1, Nixie_Buffer, sizeof(Nixie_Buffer), HAL_MAX_DELAY);
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_SET);
    HAL_Delay(delay);
    break;
  }
}

void Clear_Nixie_Buffer(void)
{
  for (uint8_t i = 0; i < sizeof(Nixie_Buffer); i++)
  {
    Nixie_Buffer[i] = 0x00;
  }
}

void Display_AlphaWorldlines(){
  uint8_t a;
  uint8_t b;
  uint8_t c;
  uint8_t d;
  uint8_t e;
  uint8_t f;

  for(uint8_t i = 0; i <12 ; i++){
    a =  Alpha_Worldlines[i] / 100000;
    b = (Alpha_Worldlines[i] % 100000) / 10000;
    c = (Alpha_Worldlines[i] % 10000) / 1000;
    d = (Alpha_Worldlines[i] % 1000) / 100;
    e = (Alpha_Worldlines[i] % 100) / 10;
    f =  Alpha_Worldlines[i] % 10;
    Loop_All_Digits();
    for(uint8_t j = 0; j < 100; j++){
      Nixie1(11);
      Clear_Nixie_Buffer();
      Nixie1(a);
      Clear_Nixie_Buffer();
      Nixie2(b);
      Clear_Nixie_Buffer();
      Nixie4(c);
      Clear_Nixie_Buffer();
      Nixie5(d);
      Clear_Nixie_Buffer();
      Nixie7(e);
      Clear_Nixie_Buffer();
      Nixie8(f);
      Clear_Nixie_Buffer();
    }
  }
}

void Loop_All_Digits(){
  for(uint8_t j = 0; j <= 5; j++){
    for(uint8_t i = 0; i < 10; i++){
      Nixie8(i);
      HAL_Delay(1);
      Clear_Nixie_Buffer();
      Nixie7(i);
      HAL_Delay(1);
      Clear_Nixie_Buffer();
      Nixie5(i);
      HAL_Delay(1);
      Clear_Nixie_Buffer();
      Nixie4(i);
      HAL_Delay(1);
      Clear_Nixie_Buffer();
      Nixie2(i);
      HAL_Delay(1);
      Clear_Nixie_Buffer();
      Nixie1(i);
      HAL_Delay(1);
      Clear_Nixie_Buffer();
    }
  }
}